garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: DAC3DATL
#define DAC3DATL DAC3DATL
DAC3DATL                                 equ 00C3h
// bitfield definitions
DAC3DATL_DAC3R_POSN                      equ 0000h
DAC3DATL_DAC3R_POSITION                  equ 0000h
DAC3DATL_DAC3R_SIZE                      equ 0008h
DAC3DATL_DAC3R_LENGTH                    equ 0008h
DAC3DATL_DAC3R_MASK                      equ 00FFh
DAC3DATL_DAC3R0_POSN                     equ 0000h
DAC3DATL_DAC3R0_POSITION                 equ 0000h
DAC3DATL_DAC3R0_SIZE                     equ 0001h
DAC3DATL_DAC3R0_LENGTH                   equ 0001h
DAC3DATL_DAC3R0_MASK                     equ 0001h
DAC3DATL_DAC3R1_POSN                     equ 0001h
DAC3DATL_DAC3R1_POSITION                 equ 0001h
DAC3DATL_DAC3R1_SIZE                     equ 0001h
DAC3DATL_DAC3R1_LENGTH                   equ 0001h
DAC3DATL_DAC3R1_MASK                     equ 0002h
DAC3DATL_DAC3R2_POSN                     equ 0002h
DAC3DATL_DAC3R2_POSITION                 equ 0002h
DAC3DATL_DAC3R2_SIZE                     equ 0001h
DAC3DATL_DAC3R2_LENGTH                   equ 0001h
DAC3DATL_DAC3R2_MASK                     equ 0004h
DAC3DATL_DAC3R3_POSN                     equ 0003h
DAC3DATL_DAC3R3_POSITION                 equ 0003h
DAC3DATL_DAC3R3_SIZE                     equ 0001h
DAC3DATL_DAC3R3_LENGTH                   equ 0001h
DAC3DATL_DAC3R3_MASK                     equ 0008h
DAC3DATL_DAC3R4_POSN                     equ 0004h
DAC3DATL_DAC3R4_POSITION                 equ 0004h
DAC3DATL_DAC3R4_SIZE                     equ 0001h
DAC3DATL_DAC3R4_LENGTH                   equ 0001h
DAC3DATL_DAC3R4_MASK                     equ 0010h
DAC3DATL_DAC3R5_POSN                     equ 0005h
DAC3DATL_DAC3R5_POSITION                 equ 0005h
DAC3DATL_DAC3R5_SIZE                     equ 0001h
DAC3DATL_DAC3R5_LENGTH                   equ 0001h
DAC3DATL_DAC3R5_MASK                     equ 0020h
DAC3DATL_DAC3R6_POSN                     equ 0006h
DAC3DATL_DAC3R6_POSITION                 equ 0006h
DAC3DATL_DAC3R6_SIZE                     equ 0001h
DAC3DATL_DAC3R6_LENGTH                   equ 0001h
DAC3DATL_DAC3R6_MASK                     equ 0040h
DAC3DATL_DAC3R7_POSN                     equ 0007h
DAC3DATL_DAC3R7_POSITION                 equ 0007h
DAC3DATL_DAC3R7_SIZE                     equ 0001h
DAC3DATL_DAC3R7_LENGTH                   equ 0001h
DAC3DATL_DAC3R7_MASK                     equ 0080h
DAC3DATL_DAC3RL_POSN                     equ 0000h
DAC3DATL_DAC3RL_POSITION                 equ 0000h
DAC3DATL_DAC3RL_SIZE                     equ 0008h
DAC3DATL_DAC3RL_LENGTH                   equ 0008h
DAC3DATL_DAC3RL_MASK                     equ 00FFh

// Register: DAC3CON
#define DAC3CON DAC3CON
DAC3CON                                  equ 00C5h
// bitfield definitions
DAC3CON_NSS_POSN                         equ 0000h
DAC3CON_NSS_POSITION                     equ 0000h
DAC3CON_NSS_SIZE                         equ 0002h
DAC3CON_NSS_LENGTH                       equ 0002h
DAC3CON_NSS_MASK                         equ 0003h
DAC3CON_PSS_POSN                         equ 0002h
DAC3CON_PSS_POSITION                     equ 0002h
DAC3CON_PSS_SIZE                         equ 0002h
DAC3CON_PSS_LENGTH                       equ 0002h
DAC3CON_PSS_MASK                         equ 000Ch
DAC3CON_OE_POSN                          equ 0004h
DAC3CON_OE_POSITION                      equ 0004h
DAC3CON_OE_SIZE                          equ 0003h
DAC3CON_OE_LENGTH                        equ 0003h
DAC3CON_OE_MASK                          equ 0070h
DAC3CON_EN_POSN                          equ 0007h
DAC3CON_EN_POSITION                      equ 0007h
DAC3CON_EN_SIZE                          equ 0001h
DAC3CON_EN_LENGTH                        equ 0001h
DAC3CON_EN_MASK                          equ 0080h
DAC3CON_DAC3NSS_POSN                     equ 0000h
DAC3CON_DAC3NSS_POSITION                 equ 0000h
DAC3CON_DAC3NSS_SIZE                     equ 0002h
DAC3CON_DAC3NSS_LENGTH                   equ 0002h
DAC3CON_DAC3NSS_MASK                     equ 0003h
DAC3CON_DAC3PSS0_POSN                    equ 0002h
DAC3CON_DAC3PSS0_POSITION                equ 0002h
DAC3CON_DAC3PSS0_SIZE                    equ 0001h
DAC3CON_DAC3PSS0_LENGTH                  equ 0001h
DAC3CON_DAC3PSS0_MASK                    equ 0004h
DAC3CON_DAC3PSS1_POSN                    equ 0003h
DAC3CON_DAC3PSS1_POSITION                equ 0003h
DAC3CON_DAC3PSS1_SIZE                    equ 0001h
DAC3CON_DAC3PSS1_LENGTH                  equ 0001h
DAC3CON_DAC3PSS1_MASK                    equ 0008h
DAC3CON_DAC3OE_POSN                      equ 0004h
DAC3CON_DAC3OE_POSITION                  equ 0004h
DAC3CON_DAC3OE_SIZE                      equ 0003h
DAC3CON_DAC3OE_LENGTH                    equ 0003h
DAC3CON_DAC3OE_MASK                      equ 0070h
DAC3CON_DAC3EN_POSN                      equ 0007h
DAC3CON_DAC3EN_POSITION                  equ 0007h
DAC3CON_DAC3EN_SIZE                      equ 0001h
DAC3CON_DAC3EN_LENGTH                    equ 0001h
DAC3CON_DAC3EN_MASK                      equ 0080h
DAC3CON_NSS0_POSN                        equ 0000h
DAC3CON_NSS0_POSITION                    equ 0000h
DAC3CON_NSS0_SIZE                        equ 0001h
DAC3CON_NSS0_LENGTH                      equ 0001h
DAC3CON_NSS0_MASK                        equ 0001h
DAC3CON_PSS0_POSN                        equ 0002h
DAC3CON_PSS0_POSITION                    equ 0002h
DAC3CON_PSS0_SIZE                        equ 0001h
DAC3CON_PSS0_LENGTH                      equ 0001h
DAC3CON_PSS0_MASK                        equ 0004h
DAC3CON_PSS1_POSN                        equ 0003h
DAC3CON_PSS1_POSITION                    equ 0003h
DAC3CON_PSS1_SIZE                        equ 0001h
DAC3CON_PSS1_LENGTH                      equ 0001h
DAC3CON_PSS1_MASK                        equ 0008h
DAC3CON_OE0_POSN                         equ 0004h
DAC3CON_OE0_POSITION                     equ 0004h
DAC3CON_OE0_SIZE                         equ 0001h
DAC3CON_OE0_LENGTH                       equ 0001h
DAC3CON_OE0_MASK                         equ 0010h
DAC3CON_OE1_POSN                         equ 0005h
DAC3CON_OE1_POSITION                     equ 0005h
DAC3CON_OE1_SIZE                         equ 0001h
DAC3CON_OE1_LENGTH                       equ 0001h
DAC3CON_OE1_MASK                         equ 0020h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 00D4h
// bitfield definitions
CLCDATA_CLC1OUT_POSN                     equ 0000h
CLCDATA_CLC1OUT_POSITION                 equ 0000h
CLCDATA_CLC1OUT_SIZE                     equ 0001h
CLCDATA_CLC1OUT_LENGTH                   equ 0001h
CLCDATA_CLC1OUT_MASK                     equ 0001h
CLCDATA_CLC2OUT_POSN                     equ 0001h
CLCDATA_CLC2OUT_POSITION                 equ 0001h
CLCDATA_CLC2OUT_SIZE                     equ 0001h
CLCDATA_CLC2OUT_LENGTH                   equ 0001h
CLCDATA_CLC2OUT_MASK                     equ 0002h
CLCDATA_CLC3OUT_POSN                     equ 0002h
CLCDATA_CLC3OUT_POSITION                 equ 0002h
CLCDATA_CLC3OUT_SIZE                     equ 0001h
CLCDATA_CLC3OUT_LENGTH                   equ 0001h
CLCDATA_CLC3OUT_MASK                     equ 0004h
CLCDATA_CLC4OUT_POSN                     equ 0003h
CLCDATA_CLC4OUT_POSITION                 equ 0003h
CLCDATA_CLC4OUT_SIZE                     equ 0001h
CLCDATA_CLC4OUT_LENGTH                   equ 0001h
CLCDATA_CLC4OUT_MASK                     equ 0008h
CLCDATA_CLC5OUT_POSN                     equ 0004h
CLCDATA_CLC5OUT_POSITION                 equ 0004h
CLCDATA_CLC5OUT_SIZE                     equ 0001h
CLCDATA_CLC5OUT_LENGTH                   equ 0001h
CLCDATA_CLC5OUT_MASK                     equ 0010h
CLCDATA_CLC6OUT_POSN                     equ 0005h
CLCDATA_CLC6OUT_POSITION                 equ 0005h
CLCDATA_CLC6OUT_SIZE                     equ 0001h
CLCDATA_CLC6OUT_LENGTH                   equ 0001h
CLCDATA_CLC6OUT_MASK                     equ 0020h
CLCDATA_CLC7OUT_POSN                     equ 0006h
CLCDATA_CLC7OUT_POSITION                 equ 0006h
CLCDATA_CLC7OUT_SIZE                     equ 0001h
CLCDATA_CLC7OUT_LENGTH                   equ 0001h
CLCDATA_CLC7OUT_MASK                     equ 0040h
CLCDATA_CLC8OUT_POSN                     equ 0007h
CLCDATA_CLC8OUT_POSITION                 equ 0007h
CLCDATA_CLC8OUT_SIZE                     equ 0001h
CLCDATA_CLC8OUT_LENGTH                   equ 0001h
CLCDATA_CLC8OUT_MASK                     equ 0080h

// Register: CLCSELECT
#define CLCSELECT CLCSELECT
CLCSELECT                                equ 00D5h
// bitfield definitions
CLCSELECT_SLCT_POSN                      equ 0000h
CLCSELECT_SLCT_POSITION                  equ 0000h
CLCSELECT_SLCT_SIZE                      equ 0008h
CLCSELECT_SLCT_LENGTH                    equ 0008h
CLCSELECT_SLCT_MASK                      equ 00FFh
CLCSELECT_SLCT0_POSN                     equ 0000h
CLCSELECT_SLCT0_POSITION                 equ 0000h
CLCSELECT_SLCT0_SIZE                     equ 0001h
CLCSELECT_SLCT0_LENGTH                   equ 0001h
CLCSELECT_SLCT0_MASK                     equ 0001h
CLCSELECT_SLCT1_POSN                     equ 0001h
CLCSELECT_SLCT1_POSITION                 equ 0001h
CLCSELECT_SLCT1_SIZE                     equ 0001h
CLCSELECT_SLCT1_LENGTH                   equ 0001h
CLCSELECT_SLCT1_MASK                     equ 0002h
CLCSELECT_SLCT2_POSN                     equ 0002h
CLCSELECT_SLCT2_POSITION                 equ 0002h
CLCSELECT_SLCT2_SIZE                     equ 0001h
CLCSELECT_SLCT2_LENGTH                   equ 0001h
CLCSELECT_SLCT2_MASK                     equ 0004h

