garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: APMEND1L
#define APMEND1L APMEND1L
APMEND1L                                 equ 01CEh
// bitfield definitions
APMEND1L_END1_POSN                       equ 0000h
APMEND1L_END1_POSITION                   equ 0000h
APMEND1L_END1_SIZE                       equ 0008h
APMEND1L_END1_LENGTH                     equ 0008h
APMEND1L_END1_MASK                       equ 00FFh

// Register: APMEND1H
#define APMEND1H APMEND1H
APMEND1H                                 equ 01CFh
// bitfield definitions
APMEND1H_END1_POSN                       equ 0000h
APMEND1H_END1_POSITION                   equ 0000h
APMEND1H_END1_SIZE                       equ 0008h
APMEND1H_END1_LENGTH                     equ 0008h
APMEND1H_END1_MASK                       equ 00FFh

// Register: APMEND1U
#define APMEND1U APMEND1U
APMEND1U                                 equ 01D0h
// bitfield definitions
APMEND1U_END1_POSN                       equ 0000h
APMEND1U_END1_POSITION                   equ 0000h
APMEND1U_END1_SIZE                       equ 0008h
APMEND1U_END1_LENGTH                     equ 0008h
APMEND1U_END1_MASK                       equ 00FFh

// Register: APMPERE1
#define APMPERE1 APMPERE1
APMPERE1                                 equ 01D1h

// Register: APMPERE1L
#define APMPERE1L APMPERE1L
APMPERE1L                                equ 01D1h
// bitfield definitions
APMPERE1L_APMPERE1_POSN                  equ 0000h
APMPERE1L_APMPERE1_POSITION              equ 0000h
APMPERE1L_APMPERE1_SIZE                  equ 0008h
APMPERE1L_APMPERE1_LENGTH                equ 0008h
APMPERE1L_APMPERE1_MASK                  equ 00FFh
APMPERE1L_BG_POSN                        equ 0002h
APMPERE1L_BG_POSITION                    equ 0002h
APMPERE1L_BG_SIZE                        equ 0001h
APMPERE1L_BG_LENGTH                      equ 0001h
APMPERE1L_BG_MASK                        equ 0004h
APMPERE1L_FVR1_POSN                      equ 0003h
APMPERE1L_FVR1_POSITION                  equ 0003h
APMPERE1L_FVR1_SIZE                      equ 0001h
APMPERE1L_FVR1_LENGTH                    equ 0001h
APMPERE1L_FVR1_MASK                      equ 0008h
APMPERE1L_FVR2_POSN                      equ 0004h
APMPERE1L_FVR2_POSITION                  equ 0004h
APMPERE1L_FVR2_SIZE                      equ 0001h
APMPERE1L_FVR2_LENGTH                    equ 0001h
APMPERE1L_FVR2_MASK                      equ 0010h
APMPERE1L_ADCD_POSN                      equ 0005h
APMPERE1L_ADCD_POSITION                  equ 0005h
APMPERE1L_ADCD_SIZE                      equ 0001h
APMPERE1L_ADCD_LENGTH                    equ 0001h
APMPERE1L_ADCD_MASK                      equ 0020h
APMPERE1L_ADCA_POSN                      equ 0006h
APMPERE1L_ADCA_POSITION                  equ 0006h
APMPERE1L_ADCA_SIZE                      equ 0001h
APMPERE1L_ADCA_LENGTH                    equ 0001h
APMPERE1L_ADCA_MASK                      equ 0040h
APMPERE1L_TEMP_POSN                      equ 0007h
APMPERE1L_TEMP_POSITION                  equ 0007h
APMPERE1L_TEMP_SIZE                      equ 0001h
APMPERE1L_TEMP_LENGTH                    equ 0001h
APMPERE1L_TEMP_MASK                      equ 0080h
APMPERE1L_APMPERE1_2_POSN                equ 0002h
APMPERE1L_APMPERE1_2_POSITION            equ 0002h
APMPERE1L_APMPERE1_2_SIZE                equ 0001h
APMPERE1L_APMPERE1_2_LENGTH              equ 0001h
APMPERE1L_APMPERE1_2_MASK                equ 0004h
APMPERE1L_APMPERE1_3_POSN                equ 0003h
APMPERE1L_APMPERE1_3_POSITION            equ 0003h
APMPERE1L_APMPERE1_3_SIZE                equ 0001h
APMPERE1L_APMPERE1_3_LENGTH              equ 0001h
APMPERE1L_APMPERE1_3_MASK                equ 0008h
APMPERE1L_APMPERE1_4_POSN                equ 0004h
APMPERE1L_APMPERE1_4_POSITION            equ 0004h
APMPERE1L_APMPERE1_4_SIZE                equ 0001h
APMPERE1L_APMPERE1_4_LENGTH              equ 0001h
APMPERE1L_APMPERE1_4_MASK                equ 0010h
APMPERE1L_APMPERE1_5_POSN                equ 0005h
APMPERE1L_APMPERE1_5_POSITION            equ 0005h
APMPERE1L_APMPERE1_5_SIZE                equ 0001h
APMPERE1L_APMPERE1_5_LENGTH              equ 0001h
APMPERE1L_APMPERE1_5_MASK                equ 0020h
APMPERE1L_APMPERE1_6_POSN                equ 0006h
APMPERE1L_APMPERE1_6_POSITION            equ 0006h
APMPERE1L_APMPERE1_6_SIZE                equ 0001h
APMPERE1L_APMPERE1_6_LENGTH              equ 0001h
APMPERE1L_APMPERE1_6_MASK                equ 0040h
APMPERE1L_APMPERE1_7_POSN                equ 0007h
APMPERE1L_APMPERE1_7_POSITION            equ 0007h
APMPERE1L_APMPERE1_7_SIZE                equ 0001h
APMPERE1L_APMPERE1_7_LENGTH              equ 0001h
APMPERE1L_APMPERE1_7_MASK                equ 0080h

// Register: APMPERE1H
#define APMPERE1H APMPERE1H
APMPERE1H                                equ 01D2h
// bitfield definitions
APMPERE1H_APMPERE1_POSN                  equ 0000h
APMPERE1H_APMPERE1_POSITION              equ 0000h
APMPERE1H_APMPERE1_SIZE                  equ 0008h
APMPERE1H_APMPERE1_LENGTH                equ 0008h
APMPERE1H_APMPERE1_MASK                  equ 00FFh
APMPERE1H_OPA1_POSN                      equ 0000h
APMPERE1H_OPA1_POSITION                  equ 0000h
APMPERE1H_OPA1_SIZE                      equ 0001h
APMPERE1H_OPA1_LENGTH                    equ 0001h
APMPERE1H_OPA1_MASK                      equ 0001h
APMPERE1H_OPA2_POSN                      equ 0001h
APMPERE1H_OPA2_POSITION                  equ 0001h
APMPERE1H_OPA2_SIZE                      equ 0001h
APMPERE1H_OPA2_LENGTH                    equ 0001h
APMPERE1H_OPA2_MASK                      equ 0002h
APMPERE1H_DAC1_POSN                      equ 0002h
APMPERE1H_DAC1_POSITION                  equ 0002h
APMPERE1H_DAC1_SIZE                      equ 0001h
APMPERE1H_DAC1_LENGTH                    equ 0001h
APMPERE1H_DAC1_MASK                      equ 0004h
APMPERE1H_DAC2_POSN                      equ 0003h
APMPERE1H_DAC2_POSITION                  equ 0003h
APMPERE1H_DAC2_SIZE                      equ 0001h
APMPERE1H_DAC2_LENGTH                    equ 0001h
APMPERE1H_DAC2_MASK                      equ 0008h
APMPERE1H_DAC3_POSN                      equ 0004h
APMPERE1H_DAC3_POSITION                  equ 0004h
APMPERE1H_DAC3_SIZE                      equ 0001h
APMPERE1H_DAC3_LENGTH                    equ 0001h
APMPERE1H_DAC3_MASK                      equ 0010h
APMPERE1H_CMP1_POSN                      equ 0005h
APMPERE1H_CMP1_POSITION                  equ 0005h
APMPERE1H_CMP1_SIZE                      equ 0001h
APMPERE1H_CMP1_LENGTH                    equ 0001h
APMPERE1H_CMP1_MASK                      equ 0020h
APMPERE1H_CMP2_POSN                      equ 0006h
APMPERE1H_CMP2_POSITION                  equ 0006h
APMPERE1H_CMP2_SIZE                      equ 0001h
APMPERE1H_CMP2_LENGTH                    equ 0001h
APMPERE1H_CMP2_MASK                      equ 0040h
APMPERE1H_ZCD_POSN                       equ 0007h
APMPERE1H_ZCD_POSITION                   equ 0007h
APMPERE1H_ZCD_SIZE                       equ 0001h
APMPERE1H_ZCD_LENGTH                     equ 0001h
APMPERE1H_ZCD_MASK                       equ 0080h
APMPERE1H_APMPERE1_8_POSN                equ 0000h
APMPERE1H_APMPERE1_8_POSITION            equ 0000h
APMPERE1H_APMPERE1_8_SIZE                equ 0001h
APMPERE1H_APMPERE1_8_LENGTH              equ 0001h
APMPERE1H_APMPERE1_8_MASK                equ 0001h
APMPERE1H_APMPERE1_9_POSN                equ 0001h
APMPERE1H_APMPERE1_9_POSITION            equ 0001h
APMPERE1H_APMPERE1_9_SIZE                equ 0001h
APMPERE1H_APMPERE1_9_LENGTH              equ 0001h
APMPERE1H_APMPERE1_9_MASK                equ 0002h
APMPERE1H_APMPERE1_10_POSN               equ 0002h
APMPERE1H_APMPERE1_10_POSITION           equ 0002h
APMPERE1H_APMPERE1_10_SIZE               equ 0001h
APMPERE1H_APMPERE1_10_LENGTH             equ 0001h
APMPERE1H_APMPERE1_10_MASK               equ 0004h
APMPERE1H_APMPERE1_11_POSN               equ 0003h
APMPERE1H_APMPERE1_11_POSITION           equ 0003h
APMPERE1H_APMPERE1_11_SIZE               equ 0001h
APMPERE1H_APMPERE1_11_LENGTH             equ 0001h
APMPERE1H_APMPERE1_11_MASK               equ 0008h
APMPERE1H_APMPERE1_12_POSN               equ 0004h
APMPERE1H_APMPERE1_12_POSITION           equ 0004h
APMPERE1H_APMPERE1_12_SIZE               equ 0001h
APMPERE1H_APMPERE1_12_LENGTH             equ 0001h
APMPERE1H_APMPERE1_12_MASK               equ 0010h
APMPERE1H_APMPERE1_13_POSN               equ 0005h
APMPERE1H_APMPERE1_13_POSITION           equ 0005h
APMPERE1H_APMPERE1_13_SIZE               equ 0001h
APMPERE1H_APMPERE1_13_LENGTH             equ 0001h
APMPERE1H_APMPERE1_13_MASK               equ 0020h
APMPERE1H_APMPERE1_14_POSN               equ 0006h
APMPERE1H_APMPERE1_14_POSITION           equ 0006h
APMPERE1H_APMPERE1_14_SIZE               equ 0001h
APMPERE1H_APMPERE1_14_LENGTH             equ 0001h
APMPERE1H_APMPERE1_14_MASK               equ 0040h
APMPERE1H_APMPERE1_15_POSN               equ 0007h
APMPERE1H_APMPERE1_15_POSITION           equ 0007h
APMPERE1H_APMPERE1_15_SIZE               equ 0001h
APMPERE1H_APMPERE1_15_LENGTH             equ 0001h
APMPERE1H_APMPERE1_15_MASK               equ 0080h

