garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: APMEND2
#define APMEND2 APMEND2
APMEND2                                  equ 01D3h

// Register: APMEND2L
#define APMEND2L APMEND2L
APMEND2L                                 equ 01D3h
// bitfield definitions
APMEND2L_END2_POSN                       equ 0000h
APMEND2L_END2_POSITION                   equ 0000h
APMEND2L_END2_SIZE                       equ 0008h
APMEND2L_END2_LENGTH                     equ 0008h
APMEND2L_END2_MASK                       equ 00FFh

// Register: APMEND2H
#define APMEND2H APMEND2H
APMEND2H                                 equ 01D4h
// bitfield definitions
APMEND2H_END2_POSN                       equ 0000h
APMEND2H_END2_POSITION                   equ 0000h
APMEND2H_END2_SIZE                       equ 0008h
APMEND2H_END2_LENGTH                     equ 0008h
APMEND2H_END2_MASK                       equ 00FFh

// Register: APMEND2U
#define APMEND2U APMEND2U
APMEND2U                                 equ 01D5h
// bitfield definitions
APMEND2U_END2_POSN                       equ 0000h
APMEND2U_END2_POSITION                   equ 0000h
APMEND2U_END2_SIZE                       equ 0008h
APMEND2U_END2_LENGTH                     equ 0008h
APMEND2U_END2_MASK                       equ 00FFh

// Register: APMPERE2
#define APMPERE2 APMPERE2
APMPERE2                                 equ 01D6h

// Register: APMPERE2L
#define APMPERE2L APMPERE2L
APMPERE2L                                equ 01D6h
// bitfield definitions
APMPERE2L_BG_POSN                        equ 0002h
APMPERE2L_BG_POSITION                    equ 0002h
APMPERE2L_BG_SIZE                        equ 0001h
APMPERE2L_BG_LENGTH                      equ 0001h
APMPERE2L_BG_MASK                        equ 0004h
APMPERE2L_FVR1_POSN                      equ 0003h
APMPERE2L_FVR1_POSITION                  equ 0003h
APMPERE2L_FVR1_SIZE                      equ 0001h
APMPERE2L_FVR1_LENGTH                    equ 0001h
APMPERE2L_FVR1_MASK                      equ 0008h
APMPERE2L_FVR2_POSN                      equ 0004h
APMPERE2L_FVR2_POSITION                  equ 0004h
APMPERE2L_FVR2_SIZE                      equ 0001h
APMPERE2L_FVR2_LENGTH                    equ 0001h
APMPERE2L_FVR2_MASK                      equ 0010h
APMPERE2L_ADCD_POSN                      equ 0005h
APMPERE2L_ADCD_POSITION                  equ 0005h
APMPERE2L_ADCD_SIZE                      equ 0001h
APMPERE2L_ADCD_LENGTH                    equ 0001h
APMPERE2L_ADCD_MASK                      equ 0020h
APMPERE2L_ADCA_POSN                      equ 0006h
APMPERE2L_ADCA_POSITION                  equ 0006h
APMPERE2L_ADCA_SIZE                      equ 0001h
APMPERE2L_ADCA_LENGTH                    equ 0001h
APMPERE2L_ADCA_MASK                      equ 0040h
APMPERE2L_TEMP_POSN                      equ 0007h
APMPERE2L_TEMP_POSITION                  equ 0007h
APMPERE2L_TEMP_SIZE                      equ 0001h
APMPERE2L_TEMP_LENGTH                    equ 0001h
APMPERE2L_TEMP_MASK                      equ 0080h
APMPERE2L_APMPERE2_POSN                  equ 0000h
APMPERE2L_APMPERE2_POSITION              equ 0000h
APMPERE2L_APMPERE2_SIZE                  equ 0008h
APMPERE2L_APMPERE2_LENGTH                equ 0008h
APMPERE2L_APMPERE2_MASK                  equ 00FFh
APMPERE2L_APMPERE2_2_POSN                equ 0002h
APMPERE2L_APMPERE2_2_POSITION            equ 0002h
APMPERE2L_APMPERE2_2_SIZE                equ 0001h
APMPERE2L_APMPERE2_2_LENGTH              equ 0001h
APMPERE2L_APMPERE2_2_MASK                equ 0004h
APMPERE2L_APMPERE2_3_POSN                equ 0003h
APMPERE2L_APMPERE2_3_POSITION            equ 0003h
APMPERE2L_APMPERE2_3_SIZE                equ 0001h
APMPERE2L_APMPERE2_3_LENGTH              equ 0001h
APMPERE2L_APMPERE2_3_MASK                equ 0008h
APMPERE2L_APMPERE2_4_POSN                equ 0004h
APMPERE2L_APMPERE2_4_POSITION            equ 0004h
APMPERE2L_APMPERE2_4_SIZE                equ 0001h
APMPERE2L_APMPERE2_4_LENGTH              equ 0001h
APMPERE2L_APMPERE2_4_MASK                equ 0010h
APMPERE2L_APMPERE2_5_POSN                equ 0005h
APMPERE2L_APMPERE2_5_POSITION            equ 0005h
APMPERE2L_APMPERE2_5_SIZE                equ 0001h
APMPERE2L_APMPERE2_5_LENGTH              equ 0001h
APMPERE2L_APMPERE2_5_MASK                equ 0020h
APMPERE2L_APMPERE2_6_POSN                equ 0006h
APMPERE2L_APMPERE2_6_POSITION            equ 0006h
APMPERE2L_APMPERE2_6_SIZE                equ 0001h
APMPERE2L_APMPERE2_6_LENGTH              equ 0001h
APMPERE2L_APMPERE2_6_MASK                equ 0040h
APMPERE2L_APMPERE2_7_POSN                equ 0007h
APMPERE2L_APMPERE2_7_POSITION            equ 0007h
APMPERE2L_APMPERE2_7_SIZE                equ 0001h
APMPERE2L_APMPERE2_7_LENGTH              equ 0001h
APMPERE2L_APMPERE2_7_MASK                equ 0080h

// Register: APMPERE2H
#define APMPERE2H APMPERE2H
APMPERE2H                                equ 01D7h
// bitfield definitions
APMPERE2H_APMPERE2_POSN                  equ 0000h
APMPERE2H_APMPERE2_POSITION              equ 0000h
APMPERE2H_APMPERE2_SIZE                  equ 0008h
APMPERE2H_APMPERE2_LENGTH                equ 0008h
APMPERE2H_APMPERE2_MASK                  equ 00FFh
APMPERE2H_OPA1_POSN                      equ 0000h
APMPERE2H_OPA1_POSITION                  equ 0000h
APMPERE2H_OPA1_SIZE                      equ 0001h
APMPERE2H_OPA1_LENGTH                    equ 0001h
APMPERE2H_OPA1_MASK                      equ 0001h
APMPERE2H_OPA2_POSN                      equ 0001h
APMPERE2H_OPA2_POSITION                  equ 0001h
APMPERE2H_OPA2_SIZE                      equ 0001h
APMPERE2H_OPA2_LENGTH                    equ 0001h
APMPERE2H_OPA2_MASK                      equ 0002h
APMPERE2H_DAC1_POSN                      equ 0002h
APMPERE2H_DAC1_POSITION                  equ 0002h
APMPERE2H_DAC1_SIZE                      equ 0001h
APMPERE2H_DAC1_LENGTH                    equ 0001h
APMPERE2H_DAC1_MASK                      equ 0004h
APMPERE2H_DAC2_POSN                      equ 0003h
APMPERE2H_DAC2_POSITION                  equ 0003h
APMPERE2H_DAC2_SIZE                      equ 0001h
APMPERE2H_DAC2_LENGTH                    equ 0001h
APMPERE2H_DAC2_MASK                      equ 0008h
APMPERE2H_DAC3_POSN                      equ 0004h
APMPERE2H_DAC3_POSITION                  equ 0004h
APMPERE2H_DAC3_SIZE                      equ 0001h
APMPERE2H_DAC3_LENGTH                    equ 0001h
APMPERE2H_DAC3_MASK                      equ 0010h
APMPERE2H_CMP1_POSN                      equ 0005h
APMPERE2H_CMP1_POSITION                  equ 0005h
APMPERE2H_CMP1_SIZE                      equ 0001h
APMPERE2H_CMP1_LENGTH                    equ 0001h
APMPERE2H_CMP1_MASK                      equ 0020h
APMPERE2H_CMP2_POSN                      equ 0006h
APMPERE2H_CMP2_POSITION                  equ 0006h
APMPERE2H_CMP2_SIZE                      equ 0001h
APMPERE2H_CMP2_LENGTH                    equ 0001h
APMPERE2H_CMP2_MASK                      equ 0040h
APMPERE2H_ZCD_POSN                       equ 0007h
APMPERE2H_ZCD_POSITION                   equ 0007h
APMPERE2H_ZCD_SIZE                       equ 0001h
APMPERE2H_ZCD_LENGTH                     equ 0001h
APMPERE2H_ZCD_MASK                       equ 0080h
APMPERE2H_APMPERE2_8_POSN                equ 0000h
APMPERE2H_APMPERE2_8_POSITION            equ 0000h
APMPERE2H_APMPERE2_8_SIZE                equ 0001h
APMPERE2H_APMPERE2_8_LENGTH              equ 0001h
APMPERE2H_APMPERE2_8_MASK                equ 0001h
APMPERE2H_APMPERE2_9_POSN                equ 0001h
APMPERE2H_APMPERE2_9_POSITION            equ 0001h
APMPERE2H_APMPERE2_9_SIZE                equ 0001h
APMPERE2H_APMPERE2_9_LENGTH              equ 0001h
APMPERE2H_APMPERE2_9_MASK                equ 0002h
APMPERE2H_APMPERE2_10_POSN               equ 0002h
APMPERE2H_APMPERE2_10_POSITION           equ 0002h
APMPERE2H_APMPERE2_10_SIZE               equ 0001h
APMPERE2H_APMPERE2_10_LENGTH             equ 0001h
APMPERE2H_APMPERE2_10_MASK               equ 0004h
APMPERE2H_APMPERE2_11_POSN               equ 0003h
APMPERE2H_APMPERE2_11_POSITION           equ 0003h
APMPERE2H_APMPERE2_11_SIZE               equ 0001h
APMPERE2H_APMPERE2_11_LENGTH             equ 0001h
APMPERE2H_APMPERE2_11_MASK               equ 0008h
APMPERE2H_APMPERE2_12_POSN               equ 0004h
APMPERE2H_APMPERE2_12_POSITION           equ 0004h
APMPERE2H_APMPERE2_12_SIZE               equ 0001h
APMPERE2H_APMPERE2_12_LENGTH             equ 0001h
APMPERE2H_APMPERE2_12_MASK               equ 0010h
APMPERE2H_APMPERE2_13_POSN               equ 0005h
APMPERE2H_APMPERE2_13_POSITION           equ 0005h
APMPERE2H_APMPERE2_13_SIZE               equ 0001h
APMPERE2H_APMPERE2_13_LENGTH             equ 0001h
APMPERE2H_APMPERE2_13_MASK               equ 0020h
APMPERE2H_APMPERE2_14_POSN               equ 0006h
APMPERE2H_APMPERE2_14_POSITION           equ 0006h
APMPERE2H_APMPERE2_14_SIZE               equ 0001h
APMPERE2H_APMPERE2_14_LENGTH             equ 0001h
APMPERE2H_APMPERE2_14_MASK               equ 0040h
APMPERE2H_APMPERE2_15_POSN               equ 0007h
APMPERE2H_APMPERE2_15_POSITION           equ 0007h
APMPERE2H_APMPERE2_15_SIZE               equ 0001h
APMPERE2H_APMPERE2_15_LENGTH             equ 0001h
APMPERE2H_APMPERE2_15_MASK               equ 0080h

// Register: APMCLK
#define APMCLK APMCLK
APMCLK                                   equ 01D8h
// bitfield definitions
APMCLK_CLK0_POSN                         equ 0000h
APMCLK_CLK0_POSITION                     equ 0000h
APMCLK_CLK0_SIZE                         equ 0001h
APMCLK_CLK0_LENGTH                       equ 0001h
APMCLK_CLK0_MASK                         equ 0001h
APMCLK_CLK1_POSN                         equ 0001h
APMCLK_CLK1_POSITION                     equ 0001h
APMCLK_CLK1_SIZE                         equ 0001h
APMCLK_CLK1_LENGTH                       equ 0001h
APMCLK_CLK1_MASK                         equ 0002h
APMCLK_CLK_POSN                          equ 0000h
APMCLK_CLK_POSITION                      equ 0000h
APMCLK_CLK_SIZE                          equ 0008h
APMCLK_CLK_LENGTH                        equ 0008h
APMCLK_CLK_MASK                          equ 00FFh
APMCLK_APMCLK_POSN                       equ 0000h
APMCLK_APMCLK_POSITION                   equ 0000h
APMCLK_APMCLK_SIZE                       equ 0008h
APMCLK_APMCLK_LENGTH                     equ 0008h
APMCLK_APMCLK_MASK                       equ 00FFh
APMCLK_APMCLK0_POSN                      equ 0000h
APMCLK_APMCLK0_POSITION                  equ 0000h
APMCLK_APMCLK0_SIZE                      equ 0001h
APMCLK_APMCLK0_LENGTH                    equ 0001h
APMCLK_APMCLK0_MASK                      equ 0001h
APMCLK_APMCLK1_POSN                      equ 0001h
APMCLK_APMCLK1_POSITION                  equ 0001h
APMCLK_APMCLK1_SIZE                      equ 0001h
APMCLK_APMCLK1_LENGTH                    equ 0001h
APMCLK_APMCLK1_MASK                      equ 0002h

// Register: APMSTATUS
#define APMSTATUS APMSTATUS
APMSTATUS                                equ 01D9h

