garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: APMSTATUSL
#define APMSTATUSL APMSTATUSL
APMSTATUSL                               equ 01D9h
// bitfield definitions
APMSTATUSL_APMSTATUS_POSN                equ 0000h
APMSTATUSL_APMSTATUS_POSITION            equ 0000h
APMSTATUSL_APMSTATUS_SIZE                equ 0008h
APMSTATUSL_APMSTATUS_LENGTH              equ 0008h
APMSTATUSL_APMSTATUS_MASK                equ 00FFh
APMSTATUSL_BG_POSN                       equ 0002h
APMSTATUSL_BG_POSITION                   equ 0002h
APMSTATUSL_BG_SIZE                       equ 0001h
APMSTATUSL_BG_LENGTH                     equ 0001h
APMSTATUSL_BG_MASK                       equ 0004h
APMSTATUSL_FVR1_POSN                     equ 0003h
APMSTATUSL_FVR1_POSITION                 equ 0003h
APMSTATUSL_FVR1_SIZE                     equ 0001h
APMSTATUSL_FVR1_LENGTH                   equ 0001h
APMSTATUSL_FVR1_MASK                     equ 0008h
APMSTATUSL_FVR2_POSN                     equ 0004h
APMSTATUSL_FVR2_POSITION                 equ 0004h
APMSTATUSL_FVR2_SIZE                     equ 0001h
APMSTATUSL_FVR2_LENGTH                   equ 0001h
APMSTATUSL_FVR2_MASK                     equ 0010h
APMSTATUSL_ADCD_POSN                     equ 0005h
APMSTATUSL_ADCD_POSITION                 equ 0005h
APMSTATUSL_ADCD_SIZE                     equ 0001h
APMSTATUSL_ADCD_LENGTH                   equ 0001h
APMSTATUSL_ADCD_MASK                     equ 0020h
APMSTATUSL_ADCA_POSN                     equ 0006h
APMSTATUSL_ADCA_POSITION                 equ 0006h
APMSTATUSL_ADCA_SIZE                     equ 0001h
APMSTATUSL_ADCA_LENGTH                   equ 0001h
APMSTATUSL_ADCA_MASK                     equ 0040h
APMSTATUSL_TEMP_POSN                     equ 0007h
APMSTATUSL_TEMP_POSITION                 equ 0007h
APMSTATUSL_TEMP_SIZE                     equ 0001h
APMSTATUSL_TEMP_LENGTH                   equ 0001h
APMSTATUSL_TEMP_MASK                     equ 0080h
APMSTATUSL_APMSTATUS_2_POSN              equ 0002h
APMSTATUSL_APMSTATUS_2_POSITION          equ 0002h
APMSTATUSL_APMSTATUS_2_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_2_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_2_MASK              equ 0004h
APMSTATUSL_APMSTATUS_3_POSN              equ 0003h
APMSTATUSL_APMSTATUS_3_POSITION          equ 0003h
APMSTATUSL_APMSTATUS_3_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_3_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_3_MASK              equ 0008h
APMSTATUSL_APMSTATUS_4_POSN              equ 0004h
APMSTATUSL_APMSTATUS_4_POSITION          equ 0004h
APMSTATUSL_APMSTATUS_4_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_4_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_4_MASK              equ 0010h
APMSTATUSL_APMSTATUS_5_POSN              equ 0005h
APMSTATUSL_APMSTATUS_5_POSITION          equ 0005h
APMSTATUSL_APMSTATUS_5_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_5_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_5_MASK              equ 0020h
APMSTATUSL_APMSTATUS_6_POSN              equ 0006h
APMSTATUSL_APMSTATUS_6_POSITION          equ 0006h
APMSTATUSL_APMSTATUS_6_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_6_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_6_MASK              equ 0040h
APMSTATUSL_APMSTATUS_7_POSN              equ 0007h
APMSTATUSL_APMSTATUS_7_POSITION          equ 0007h
APMSTATUSL_APMSTATUS_7_SIZE              equ 0001h
APMSTATUSL_APMSTATUS_7_LENGTH            equ 0001h
APMSTATUSL_APMSTATUS_7_MASK              equ 0080h

// Register: APMSTATUSH
#define APMSTATUSH APMSTATUSH
APMSTATUSH                               equ 01DAh
// bitfield definitions
APMSTATUSH_APMSTATUS_POSN                equ 0000h
APMSTATUSH_APMSTATUS_POSITION            equ 0000h
APMSTATUSH_APMSTATUS_SIZE                equ 0008h
APMSTATUSH_APMSTATUS_LENGTH              equ 0008h
APMSTATUSH_APMSTATUS_MASK                equ 00FFh
APMSTATUSH_OPA1_POSN                     equ 0000h
APMSTATUSH_OPA1_POSITION                 equ 0000h
APMSTATUSH_OPA1_SIZE                     equ 0001h
APMSTATUSH_OPA1_LENGTH                   equ 0001h
APMSTATUSH_OPA1_MASK                     equ 0001h
APMSTATUSH_OPA2_POSN                     equ 0001h
APMSTATUSH_OPA2_POSITION                 equ 0001h
APMSTATUSH_OPA2_SIZE                     equ 0001h
APMSTATUSH_OPA2_LENGTH                   equ 0001h
APMSTATUSH_OPA2_MASK                     equ 0002h
APMSTATUSH_DAC1_POSN                     equ 0002h
APMSTATUSH_DAC1_POSITION                 equ 0002h
APMSTATUSH_DAC1_SIZE                     equ 0001h
APMSTATUSH_DAC1_LENGTH                   equ 0001h
APMSTATUSH_DAC1_MASK                     equ 0004h
APMSTATUSH_DAC2_POSN                     equ 0003h
APMSTATUSH_DAC2_POSITION                 equ 0003h
APMSTATUSH_DAC2_SIZE                     equ 0001h
APMSTATUSH_DAC2_LENGTH                   equ 0001h
APMSTATUSH_DAC2_MASK                     equ 0008h
APMSTATUSH_DAC3_POSN                     equ 0004h
APMSTATUSH_DAC3_POSITION                 equ 0004h
APMSTATUSH_DAC3_SIZE                     equ 0001h
APMSTATUSH_DAC3_LENGTH                   equ 0001h
APMSTATUSH_DAC3_MASK                     equ 0010h
APMSTATUSH_CMP1_POSN                     equ 0005h
APMSTATUSH_CMP1_POSITION                 equ 0005h
APMSTATUSH_CMP1_SIZE                     equ 0001h
APMSTATUSH_CMP1_LENGTH                   equ 0001h
APMSTATUSH_CMP1_MASK                     equ 0020h
APMSTATUSH_CMP2_POSN                     equ 0006h
APMSTATUSH_CMP2_POSITION                 equ 0006h
APMSTATUSH_CMP2_SIZE                     equ 0001h
APMSTATUSH_CMP2_LENGTH                   equ 0001h
APMSTATUSH_CMP2_MASK                     equ 0040h
APMSTATUSH_ZCD_POSN                      equ 0007h
APMSTATUSH_ZCD_POSITION                  equ 0007h
APMSTATUSH_ZCD_SIZE                      equ 0001h
APMSTATUSH_ZCD_LENGTH                    equ 0001h
APMSTATUSH_ZCD_MASK                      equ 0080h
APMSTATUSH_APMSTATUS_8_POSN              equ 0000h
APMSTATUSH_APMSTATUS_8_POSITION          equ 0000h
APMSTATUSH_APMSTATUS_8_SIZE              equ 0001h
APMSTATUSH_APMSTATUS_8_LENGTH            equ 0001h
APMSTATUSH_APMSTATUS_8_MASK              equ 0001h
APMSTATUSH_APMSTATUS_9_POSN              equ 0001h
APMSTATUSH_APMSTATUS_9_POSITION          equ 0001h
APMSTATUSH_APMSTATUS_9_SIZE              equ 0001h
APMSTATUSH_APMSTATUS_9_LENGTH            equ 0001h
APMSTATUSH_APMSTATUS_9_MASK              equ 0002h
APMSTATUSH_APMSTATUS_10_POSN             equ 0002h
APMSTATUSH_APMSTATUS_10_POSITION         equ 0002h
APMSTATUSH_APMSTATUS_10_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_10_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_10_MASK             equ 0004h
APMSTATUSH_APMSTATUS_11_POSN             equ 0003h
APMSTATUSH_APMSTATUS_11_POSITION         equ 0003h
APMSTATUSH_APMSTATUS_11_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_11_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_11_MASK             equ 0008h
APMSTATUSH_APMSTATUS_12_POSN             equ 0004h
APMSTATUSH_APMSTATUS_12_POSITION         equ 0004h
APMSTATUSH_APMSTATUS_12_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_12_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_12_MASK             equ 0010h
APMSTATUSH_APMSTATUS_13_POSN             equ 0005h
APMSTATUSH_APMSTATUS_13_POSITION         equ 0005h
APMSTATUSH_APMSTATUS_13_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_13_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_13_MASK             equ 0020h
APMSTATUSH_APMSTATUS_14_POSN             equ 0006h
APMSTATUSH_APMSTATUS_14_POSITION         equ 0006h
APMSTATUSH_APMSTATUS_14_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_14_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_14_MASK             equ 0040h
APMSTATUSH_APMSTATUS_15_POSN             equ 0007h
APMSTATUSH_APMSTATUS_15_POSITION         equ 0007h
APMSTATUSH_APMSTATUS_15_SIZE             equ 0001h
APMSTATUSH_APMSTATUS_15_LENGTH           equ 0001h
APMSTATUSH_APMSTATUS_15_MASK             equ 0080h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0200h
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0201h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0202h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0203h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

