garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: U2ERRIR
#define U2ERRIR U2ERRIR
U2ERRIR                                  equ 02C5h
// bitfield definitions
U2ERRIR_TXCIF_POSN                       equ 0000h
U2ERRIR_TXCIF_POSITION                   equ 0000h
U2ERRIR_TXCIF_SIZE                       equ 0001h
U2ERRIR_TXCIF_LENGTH                     equ 0001h
U2ERRIR_TXCIF_MASK                       equ 0001h
U2ERRIR_RXFOIF_POSN                      equ 0001h
U2ERRIR_RXFOIF_POSITION                  equ 0001h
U2ERRIR_RXFOIF_SIZE                      equ 0001h
U2ERRIR_RXFOIF_LENGTH                    equ 0001h
U2ERRIR_RXFOIF_MASK                      equ 0002h
U2ERRIR_RXBKIF_POSN                      equ 0002h
U2ERRIR_RXBKIF_POSITION                  equ 0002h
U2ERRIR_RXBKIF_SIZE                      equ 0001h
U2ERRIR_RXBKIF_LENGTH                    equ 0001h
U2ERRIR_RXBKIF_MASK                      equ 0004h
U2ERRIR_FERIF_POSN                       equ 0003h
U2ERRIR_FERIF_POSITION                   equ 0003h
U2ERRIR_FERIF_SIZE                       equ 0001h
U2ERRIR_FERIF_LENGTH                     equ 0001h
U2ERRIR_FERIF_MASK                       equ 0008h
U2ERRIR_CERIF_POSN                       equ 0004h
U2ERRIR_CERIF_POSITION                   equ 0004h
U2ERRIR_CERIF_SIZE                       equ 0001h
U2ERRIR_CERIF_LENGTH                     equ 0001h
U2ERRIR_CERIF_MASK                       equ 0010h
U2ERRIR_ABDOVF_POSN                      equ 0005h
U2ERRIR_ABDOVF_POSITION                  equ 0005h
U2ERRIR_ABDOVF_SIZE                      equ 0001h
U2ERRIR_ABDOVF_LENGTH                    equ 0001h
U2ERRIR_ABDOVF_MASK                      equ 0020h
U2ERRIR_PERIF_POSN                       equ 0006h
U2ERRIR_PERIF_POSITION                   equ 0006h
U2ERRIR_PERIF_SIZE                       equ 0001h
U2ERRIR_PERIF_LENGTH                     equ 0001h
U2ERRIR_PERIF_MASK                       equ 0040h
U2ERRIR_TXMTIF_POSN                      equ 0007h
U2ERRIR_TXMTIF_POSITION                  equ 0007h
U2ERRIR_TXMTIF_SIZE                      equ 0001h
U2ERRIR_TXMTIF_LENGTH                    equ 0001h
U2ERRIR_TXMTIF_MASK                      equ 0080h
U2ERRIR_U2TXCIF_POSN                     equ 0000h
U2ERRIR_U2TXCIF_POSITION                 equ 0000h
U2ERRIR_U2TXCIF_SIZE                     equ 0001h
U2ERRIR_U2TXCIF_LENGTH                   equ 0001h
U2ERRIR_U2TXCIF_MASK                     equ 0001h
U2ERRIR_U2RXFOIF_POSN                    equ 0001h
U2ERRIR_U2RXFOIF_POSITION                equ 0001h
U2ERRIR_U2RXFOIF_SIZE                    equ 0001h
U2ERRIR_U2RXFOIF_LENGTH                  equ 0001h
U2ERRIR_U2RXFOIF_MASK                    equ 0002h
U2ERRIR_U2RXBKIF_POSN                    equ 0002h
U2ERRIR_U2RXBKIF_POSITION                equ 0002h
U2ERRIR_U2RXBKIF_SIZE                    equ 0001h
U2ERRIR_U2RXBKIF_LENGTH                  equ 0001h
U2ERRIR_U2RXBKIF_MASK                    equ 0004h
U2ERRIR_U2FERIF_POSN                     equ 0003h
U2ERRIR_U2FERIF_POSITION                 equ 0003h
U2ERRIR_U2FERIF_SIZE                     equ 0001h
U2ERRIR_U2FERIF_LENGTH                   equ 0001h
U2ERRIR_U2FERIF_MASK                     equ 0008h
U2ERRIR_U2CERIF_POSN                     equ 0004h
U2ERRIR_U2CERIF_POSITION                 equ 0004h
U2ERRIR_U2CERIF_SIZE                     equ 0001h
U2ERRIR_U2CERIF_LENGTH                   equ 0001h
U2ERRIR_U2CERIF_MASK                     equ 0010h
U2ERRIR_U2ABDOVF_POSN                    equ 0005h
U2ERRIR_U2ABDOVF_POSITION                equ 0005h
U2ERRIR_U2ABDOVF_SIZE                    equ 0001h
U2ERRIR_U2ABDOVF_LENGTH                  equ 0001h
U2ERRIR_U2ABDOVF_MASK                    equ 0020h
U2ERRIR_U2PERIF_POSN                     equ 0006h
U2ERRIR_U2PERIF_POSITION                 equ 0006h
U2ERRIR_U2PERIF_SIZE                     equ 0001h
U2ERRIR_U2PERIF_LENGTH                   equ 0001h
U2ERRIR_U2PERIF_MASK                     equ 0040h
U2ERRIR_U2TXMTIF_POSN                    equ 0007h
U2ERRIR_U2TXMTIF_POSITION                equ 0007h
U2ERRIR_U2TXMTIF_SIZE                    equ 0001h
U2ERRIR_U2TXMTIF_LENGTH                  equ 0001h
U2ERRIR_U2TXMTIF_MASK                    equ 0080h

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
U2ERRIE                                  equ 02C6h
// bitfield definitions
U2ERRIE_TXCIE_POSN                       equ 0000h
U2ERRIE_TXCIE_POSITION                   equ 0000h
U2ERRIE_TXCIE_SIZE                       equ 0001h
U2ERRIE_TXCIE_LENGTH                     equ 0001h
U2ERRIE_TXCIE_MASK                       equ 0001h
U2ERRIE_RXFOIE_POSN                      equ 0001h
U2ERRIE_RXFOIE_POSITION                  equ 0001h
U2ERRIE_RXFOIE_SIZE                      equ 0001h
U2ERRIE_RXFOIE_LENGTH                    equ 0001h
U2ERRIE_RXFOIE_MASK                      equ 0002h
U2ERRIE_RXBKIE_POSN                      equ 0002h
U2ERRIE_RXBKIE_POSITION                  equ 0002h
U2ERRIE_RXBKIE_SIZE                      equ 0001h
U2ERRIE_RXBKIE_LENGTH                    equ 0001h
U2ERRIE_RXBKIE_MASK                      equ 0004h
U2ERRIE_FERIE_POSN                       equ 0003h
U2ERRIE_FERIE_POSITION                   equ 0003h
U2ERRIE_FERIE_SIZE                       equ 0001h
U2ERRIE_FERIE_LENGTH                     equ 0001h
U2ERRIE_FERIE_MASK                       equ 0008h
U2ERRIE_CERIE_POSN                       equ 0004h
U2ERRIE_CERIE_POSITION                   equ 0004h
U2ERRIE_CERIE_SIZE                       equ 0001h
U2ERRIE_CERIE_LENGTH                     equ 0001h
U2ERRIE_CERIE_MASK                       equ 0010h
U2ERRIE_ABDOVE_POSN                      equ 0005h
U2ERRIE_ABDOVE_POSITION                  equ 0005h
U2ERRIE_ABDOVE_SIZE                      equ 0001h
U2ERRIE_ABDOVE_LENGTH                    equ 0001h
U2ERRIE_ABDOVE_MASK                      equ 0020h
U2ERRIE_PERIE_POSN                       equ 0006h
U2ERRIE_PERIE_POSITION                   equ 0006h
U2ERRIE_PERIE_SIZE                       equ 0001h
U2ERRIE_PERIE_LENGTH                     equ 0001h
U2ERRIE_PERIE_MASK                       equ 0040h
U2ERRIE_TXMTIE_POSN                      equ 0007h
U2ERRIE_TXMTIE_POSITION                  equ 0007h
U2ERRIE_TXMTIE_SIZE                      equ 0001h
U2ERRIE_TXMTIE_LENGTH                    equ 0001h
U2ERRIE_TXMTIE_MASK                      equ 0080h
U2ERRIE_U2TXCIE_POSN                     equ 0000h
U2ERRIE_U2TXCIE_POSITION                 equ 0000h
U2ERRIE_U2TXCIE_SIZE                     equ 0001h
U2ERRIE_U2TXCIE_LENGTH                   equ 0001h
U2ERRIE_U2TXCIE_MASK                     equ 0001h
U2ERRIE_U2RXFOIE_POSN                    equ 0001h
U2ERRIE_U2RXFOIE_POSITION                equ 0001h
U2ERRIE_U2RXFOIE_SIZE                    equ 0001h
U2ERRIE_U2RXFOIE_LENGTH                  equ 0001h
U2ERRIE_U2RXFOIE_MASK                    equ 0002h
U2ERRIE_U2RXBKIE_POSN                    equ 0002h
U2ERRIE_U2RXBKIE_POSITION                equ 0002h
U2ERRIE_U2RXBKIE_SIZE                    equ 0001h
U2ERRIE_U2RXBKIE_LENGTH                  equ 0001h
U2ERRIE_U2RXBKIE_MASK                    equ 0004h
U2ERRIE_U2FERIE_POSN                     equ 0003h
U2ERRIE_U2FERIE_POSITION                 equ 0003h
U2ERRIE_U2FERIE_SIZE                     equ 0001h
U2ERRIE_U2FERIE_LENGTH                   equ 0001h
U2ERRIE_U2FERIE_MASK                     equ 0008h
U2ERRIE_U2CERIE_POSN                     equ 0004h
U2ERRIE_U2CERIE_POSITION                 equ 0004h
U2ERRIE_U2CERIE_SIZE                     equ 0001h
U2ERRIE_U2CERIE_LENGTH                   equ 0001h
U2ERRIE_U2CERIE_MASK                     equ 0010h
U2ERRIE_U2ABDOVE_POSN                    equ 0005h
U2ERRIE_U2ABDOVE_POSITION                equ 0005h
U2ERRIE_U2ABDOVE_SIZE                    equ 0001h
U2ERRIE_U2ABDOVE_LENGTH                  equ 0001h
U2ERRIE_U2ABDOVE_MASK                    equ 0020h
U2ERRIE_U2PERIE_POSN                     equ 0006h
U2ERRIE_U2PERIE_POSITION                 equ 0006h
U2ERRIE_U2PERIE_SIZE                     equ 0001h
U2ERRIE_U2PERIE_LENGTH                   equ 0001h
U2ERRIE_U2PERIE_MASK                     equ 0040h
U2ERRIE_U2TXMTIE_POSN                    equ 0007h
U2ERRIE_U2TXMTIE_POSITION                equ 0007h
U2ERRIE_U2TXMTIE_SIZE                    equ 0001h
U2ERRIE_U2TXMTIE_LENGTH                  equ 0001h
U2ERRIE_U2TXMTIE_MASK                    equ 0080h

// Register: TMR1
#define TMR1 TMR1
TMR1                                     equ 0312h

// Register: TMR1L
#define TMR1L TMR1L
TMR1L                                    equ 0312h
// bitfield definitions
TMR1L_TMR1L_POSN                         equ 0000h
TMR1L_TMR1L_POSITION                     equ 0000h
TMR1L_TMR1L_SIZE                         equ 0008h
TMR1L_TMR1L_LENGTH                       equ 0008h
TMR1L_TMR1L_MASK                         equ 00FFh
TMR1L_TMR1L0_POSN                        equ 0000h
TMR1L_TMR1L0_POSITION                    equ 0000h
TMR1L_TMR1L0_SIZE                        equ 0001h
TMR1L_TMR1L0_LENGTH                      equ 0001h
TMR1L_TMR1L0_MASK                        equ 0001h
TMR1L_TMR1L1_POSN                        equ 0001h
TMR1L_TMR1L1_POSITION                    equ 0001h
TMR1L_TMR1L1_SIZE                        equ 0001h
TMR1L_TMR1L1_LENGTH                      equ 0001h
TMR1L_TMR1L1_MASK                        equ 0002h
TMR1L_TMR1L2_POSN                        equ 0002h
TMR1L_TMR1L2_POSITION                    equ 0002h
TMR1L_TMR1L2_SIZE                        equ 0001h
TMR1L_TMR1L2_LENGTH                      equ 0001h
TMR1L_TMR1L2_MASK                        equ 0004h
TMR1L_TMR1L3_POSN                        equ 0003h
TMR1L_TMR1L3_POSITION                    equ 0003h
TMR1L_TMR1L3_SIZE                        equ 0001h
TMR1L_TMR1L3_LENGTH                      equ 0001h
TMR1L_TMR1L3_MASK                        equ 0008h
TMR1L_TMR1L4_POSN                        equ 0004h
TMR1L_TMR1L4_POSITION                    equ 0004h
TMR1L_TMR1L4_SIZE                        equ 0001h
TMR1L_TMR1L4_LENGTH                      equ 0001h
TMR1L_TMR1L4_MASK                        equ 0010h
TMR1L_TMR1L5_POSN                        equ 0005h
TMR1L_TMR1L5_POSITION                    equ 0005h
TMR1L_TMR1L5_SIZE                        equ 0001h
TMR1L_TMR1L5_LENGTH                      equ 0001h
TMR1L_TMR1L5_MASK                        equ 0020h
TMR1L_TMR1L6_POSN                        equ 0006h
TMR1L_TMR1L6_POSITION                    equ 0006h
TMR1L_TMR1L6_SIZE                        equ 0001h
TMR1L_TMR1L6_LENGTH                      equ 0001h
TMR1L_TMR1L6_MASK                        equ 0040h
TMR1L_TMR1L7_POSN                        equ 0007h
TMR1L_TMR1L7_POSITION                    equ 0007h
TMR1L_TMR1L7_SIZE                        equ 0001h
TMR1L_TMR1L7_LENGTH                      equ 0001h
TMR1L_TMR1L7_MASK                        equ 0080h
TMR1L_TMR10_POSN                         equ 0000h
TMR1L_TMR10_POSITION                     equ 0000h
TMR1L_TMR10_SIZE                         equ 0001h
TMR1L_TMR10_LENGTH                       equ 0001h
TMR1L_TMR10_MASK                         equ 0001h
TMR1L_TMR11_POSN                         equ 0001h
TMR1L_TMR11_POSITION                     equ 0001h
TMR1L_TMR11_SIZE                         equ 0001h
TMR1L_TMR11_LENGTH                       equ 0001h
TMR1L_TMR11_MASK                         equ 0002h
TMR1L_TMR12_POSN                         equ 0002h
TMR1L_TMR12_POSITION                     equ 0002h
TMR1L_TMR12_SIZE                         equ 0001h
TMR1L_TMR12_LENGTH                       equ 0001h
TMR1L_TMR12_MASK                         equ 0004h
TMR1L_TMR13_POSN                         equ 0003h
TMR1L_TMR13_POSITION                     equ 0003h
TMR1L_TMR13_SIZE                         equ 0001h
TMR1L_TMR13_LENGTH                       equ 0001h
TMR1L_TMR13_MASK                         equ 0008h
TMR1L_TMR14_POSN                         equ 0004h
TMR1L_TMR14_POSITION                     equ 0004h
TMR1L_TMR14_SIZE                         equ 0001h
TMR1L_TMR14_LENGTH                       equ 0001h
TMR1L_TMR14_MASK                         equ 0010h
TMR1L_TMR15_POSN                         equ 0005h
TMR1L_TMR15_POSITION                     equ 0005h
TMR1L_TMR15_SIZE                         equ 0001h
TMR1L_TMR15_LENGTH                       equ 0001h
TMR1L_TMR15_MASK                         equ 0020h
TMR1L_TMR16_POSN                         equ 0006h
TMR1L_TMR16_POSITION                     equ 0006h
TMR1L_TMR16_SIZE                         equ 0001h
TMR1L_TMR16_LENGTH                       equ 0001h
TMR1L_TMR16_MASK                         equ 0040h
TMR1L_TMR17_POSN                         equ 0007h
TMR1L_TMR17_POSITION                     equ 0007h
TMR1L_TMR17_SIZE                         equ 0001h
TMR1L_TMR17_LENGTH                       equ 0001h
TMR1L_TMR17_MASK                         equ 0080h

// Register: TMR1H
#define TMR1H TMR1H
TMR1H                                    equ 0313h
// bitfield definitions
TMR1H_TMR1H_POSN                         equ 0000h
TMR1H_TMR1H_POSITION                     equ 0000h
TMR1H_TMR1H_SIZE                         equ 0008h
TMR1H_TMR1H_LENGTH                       equ 0008h
TMR1H_TMR1H_MASK                         equ 00FFh
TMR1H_TMR1H0_POSN                        equ 0000h
TMR1H_TMR1H0_POSITION                    equ 0000h
TMR1H_TMR1H0_SIZE                        equ 0001h
TMR1H_TMR1H0_LENGTH                      equ 0001h
TMR1H_TMR1H0_MASK                        equ 0001h
TMR1H_TMR1H1_POSN                        equ 0001h
TMR1H_TMR1H1_POSITION                    equ 0001h
TMR1H_TMR1H1_SIZE                        equ 0001h
TMR1H_TMR1H1_LENGTH                      equ 0001h
TMR1H_TMR1H1_MASK                        equ 0002h
TMR1H_TMR1H2_POSN                        equ 0002h
TMR1H_TMR1H2_POSITION                    equ 0002h
TMR1H_TMR1H2_SIZE                        equ 0001h
TMR1H_TMR1H2_LENGTH                      equ 0001h
TMR1H_TMR1H2_MASK                        equ 0004h
TMR1H_TMR1H3_POSN                        equ 0003h
TMR1H_TMR1H3_POSITION                    equ 0003h
TMR1H_TMR1H3_SIZE                        equ 0001h
TMR1H_TMR1H3_LENGTH                      equ 0001h
TMR1H_TMR1H3_MASK                        equ 0008h
TMR1H_TMR1H4_POSN                        equ 0004h
TMR1H_TMR1H4_POSITION                    equ 0004h
TMR1H_TMR1H4_SIZE                        equ 0001h
TMR1H_TMR1H4_LENGTH                      equ 0001h
TMR1H_TMR1H4_MASK                        equ 0010h
TMR1H_TMR1H5_POSN                        equ 0005h
TMR1H_TMR1H5_POSITION                    equ 0005h
TMR1H_TMR1H5_SIZE                        equ 0001h
TMR1H_TMR1H5_LENGTH                      equ 0001h
TMR1H_TMR1H5_MASK                        equ 0020h
TMR1H_TMR1H6_POSN                        equ 0006h
TMR1H_TMR1H6_POSITION                    equ 0006h
TMR1H_TMR1H6_SIZE                        equ 0001h
TMR1H_TMR1H6_LENGTH                      equ 0001h
TMR1H_TMR1H6_MASK                        equ 0040h
TMR1H_TMR1H7_POSN                        equ 0007h
TMR1H_TMR1H7_POSITION                    equ 0007h
TMR1H_TMR1H7_SIZE                        equ 0001h
TMR1H_TMR1H7_LENGTH                      equ 0001h
TMR1H_TMR1H7_MASK                        equ 0080h
TMR1H_TMR18_POSN                         equ 0000h
TMR1H_TMR18_POSITION                     equ 0000h
TMR1H_TMR18_SIZE                         equ 0001h
TMR1H_TMR18_LENGTH                       equ 0001h
TMR1H_TMR18_MASK                         equ 0001h
TMR1H_TMR19_POSN                         equ 0001h
TMR1H_TMR19_POSITION                     equ 0001h
TMR1H_TMR19_SIZE                         equ 0001h
TMR1H_TMR19_LENGTH                       equ 0001h
TMR1H_TMR19_MASK                         equ 0002h
TMR1H_TMR110_POSN                        equ 0002h
TMR1H_TMR110_POSITION                    equ 0002h
TMR1H_TMR110_SIZE                        equ 0001h
TMR1H_TMR110_LENGTH                      equ 0001h
TMR1H_TMR110_MASK                        equ 0004h
TMR1H_TMR111_POSN                        equ 0003h
TMR1H_TMR111_POSITION                    equ 0003h
TMR1H_TMR111_SIZE                        equ 0001h
TMR1H_TMR111_LENGTH                      equ 0001h
TMR1H_TMR111_MASK                        equ 0008h
TMR1H_TMR112_POSN                        equ 0004h
TMR1H_TMR112_POSITION                    equ 0004h
TMR1H_TMR112_SIZE                        equ 0001h
TMR1H_TMR112_LENGTH                      equ 0001h
TMR1H_TMR112_MASK                        equ 0010h
TMR1H_TMR113_POSN                        equ 0005h
TMR1H_TMR113_POSITION                    equ 0005h
TMR1H_TMR113_SIZE                        equ 0001h
TMR1H_TMR113_LENGTH                      equ 0001h
TMR1H_TMR113_MASK                        equ 0020h
TMR1H_TMR114_POSN                        equ 0006h
TMR1H_TMR114_POSITION                    equ 0006h
TMR1H_TMR114_SIZE                        equ 0001h
TMR1H_TMR114_LENGTH                      equ 0001h
TMR1H_TMR114_MASK                        equ 0040h
TMR1H_TMR115_POSN                        equ 0007h
TMR1H_TMR115_POSITION                    equ 0007h
TMR1H_TMR115_SIZE                        equ 0001h
TMR1H_TMR115_LENGTH                      equ 0001h
TMR1H_TMR115_MASK                        equ 0080h

