garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: TU16ATMRH
#define TU16ATMRH TU16ATMRH
TU16ATMRH                                equ 03A5h
// bitfield definitions
TU16ATMRH_TMRH_POSN                      equ 0000h
TU16ATMRH_TMRH_POSITION                  equ 0000h
TU16ATMRH_TMRH_SIZE                      equ 0008h
TU16ATMRH_TMRH_LENGTH                    equ 0008h
TU16ATMRH_TMRH_MASK                      equ 00FFh
TU16ATMRH_TMRH0_POSN                     equ 0000h
TU16ATMRH_TMRH0_POSITION                 equ 0000h
TU16ATMRH_TMRH0_SIZE                     equ 0001h
TU16ATMRH_TMRH0_LENGTH                   equ 0001h
TU16ATMRH_TMRH0_MASK                     equ 0001h
TU16ATMRH_TMRH1_POSN                     equ 0001h
TU16ATMRH_TMRH1_POSITION                 equ 0001h
TU16ATMRH_TMRH1_SIZE                     equ 0001h
TU16ATMRH_TMRH1_LENGTH                   equ 0001h
TU16ATMRH_TMRH1_MASK                     equ 0002h
TU16ATMRH_TMRH2_POSN                     equ 0002h
TU16ATMRH_TMRH2_POSITION                 equ 0002h
TU16ATMRH_TMRH2_SIZE                     equ 0001h
TU16ATMRH_TMRH2_LENGTH                   equ 0001h
TU16ATMRH_TMRH2_MASK                     equ 0004h
TU16ATMRH_TMRH3_POSN                     equ 0003h
TU16ATMRH_TMRH3_POSITION                 equ 0003h
TU16ATMRH_TMRH3_SIZE                     equ 0001h
TU16ATMRH_TMRH3_LENGTH                   equ 0001h
TU16ATMRH_TMRH3_MASK                     equ 0008h
TU16ATMRH_TMRH4_POSN                     equ 0004h
TU16ATMRH_TMRH4_POSITION                 equ 0004h
TU16ATMRH_TMRH4_SIZE                     equ 0001h
TU16ATMRH_TMRH4_LENGTH                   equ 0001h
TU16ATMRH_TMRH4_MASK                     equ 0010h
TU16ATMRH_TMRH5_POSN                     equ 0005h
TU16ATMRH_TMRH5_POSITION                 equ 0005h
TU16ATMRH_TMRH5_SIZE                     equ 0001h
TU16ATMRH_TMRH5_LENGTH                   equ 0001h
TU16ATMRH_TMRH5_MASK                     equ 0020h
TU16ATMRH_TMRH6_POSN                     equ 0006h
TU16ATMRH_TMRH6_POSITION                 equ 0006h
TU16ATMRH_TMRH6_SIZE                     equ 0001h
TU16ATMRH_TMRH6_LENGTH                   equ 0001h
TU16ATMRH_TMRH6_MASK                     equ 0040h
TU16ATMRH_TMRH7_POSN                     equ 0007h
TU16ATMRH_TMRH7_POSITION                 equ 0007h
TU16ATMRH_TMRH7_SIZE                     equ 0001h
TU16ATMRH_TMRH7_LENGTH                   equ 0001h
TU16ATMRH_TMRH7_MASK                     equ 0080h
TU16ATMRH_TU16ATMRH0_POSN                equ 0000h
TU16ATMRH_TU16ATMRH0_POSITION            equ 0000h
TU16ATMRH_TU16ATMRH0_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH0_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH0_MASK                equ 0001h
TU16ATMRH_TU16ATMRH1_POSN                equ 0001h
TU16ATMRH_TU16ATMRH1_POSITION            equ 0001h
TU16ATMRH_TU16ATMRH1_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH1_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH1_MASK                equ 0002h
TU16ATMRH_TU16ATMRH2_POSN                equ 0002h
TU16ATMRH_TU16ATMRH2_POSITION            equ 0002h
TU16ATMRH_TU16ATMRH2_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH2_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH2_MASK                equ 0004h
TU16ATMRH_TU16ATMRH3_POSN                equ 0003h
TU16ATMRH_TU16ATMRH3_POSITION            equ 0003h
TU16ATMRH_TU16ATMRH3_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH3_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH3_MASK                equ 0008h
TU16ATMRH_TU16ATMRH4_POSN                equ 0004h
TU16ATMRH_TU16ATMRH4_POSITION            equ 0004h
TU16ATMRH_TU16ATMRH4_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH4_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH4_MASK                equ 0010h
TU16ATMRH_TU16ATMRH5_POSN                equ 0005h
TU16ATMRH_TU16ATMRH5_POSITION            equ 0005h
TU16ATMRH_TU16ATMRH5_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH5_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH5_MASK                equ 0020h
TU16ATMRH_TU16ATMRH6_POSN                equ 0006h
TU16ATMRH_TU16ATMRH6_POSITION            equ 0006h
TU16ATMRH_TU16ATMRH6_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH6_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH6_MASK                equ 0040h
TU16ATMRH_TU16ATMRH7_POSN                equ 0007h
TU16ATMRH_TU16ATMRH7_POSITION            equ 0007h
TU16ATMRH_TU16ATMRH7_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH7_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH7_MASK                equ 0080h
TU16ATMRH_TU16ATMR8_POSN                 equ 0000h
TU16ATMRH_TU16ATMR8_POSITION             equ 0000h
TU16ATMRH_TU16ATMR8_SIZE                 equ 0001h
TU16ATMRH_TU16ATMR8_LENGTH               equ 0001h
TU16ATMRH_TU16ATMR8_MASK                 equ 0001h
TU16ATMRH_TU16ATMR9_POSN                 equ 0001h
TU16ATMRH_TU16ATMR9_POSITION             equ 0001h
TU16ATMRH_TU16ATMR9_SIZE                 equ 0001h
TU16ATMRH_TU16ATMR9_LENGTH               equ 0001h
TU16ATMRH_TU16ATMR9_MASK                 equ 0002h
TU16ATMRH_TU16ATMR10_POSN                equ 0002h
TU16ATMRH_TU16ATMR10_POSITION            equ 0002h
TU16ATMRH_TU16ATMR10_SIZE                equ 0001h
TU16ATMRH_TU16ATMR10_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR10_MASK                equ 0004h
TU16ATMRH_TU16ATMR11_POSN                equ 0003h
TU16ATMRH_TU16ATMR11_POSITION            equ 0003h
TU16ATMRH_TU16ATMR11_SIZE                equ 0001h
TU16ATMRH_TU16ATMR11_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR11_MASK                equ 0008h
TU16ATMRH_TU16ATMR12_POSN                equ 0004h
TU16ATMRH_TU16ATMR12_POSITION            equ 0004h
TU16ATMRH_TU16ATMR12_SIZE                equ 0001h
TU16ATMRH_TU16ATMR12_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR12_MASK                equ 0010h
TU16ATMRH_TU16ATMR13_POSN                equ 0005h
TU16ATMRH_TU16ATMR13_POSITION            equ 0005h
TU16ATMRH_TU16ATMR13_SIZE                equ 0001h
TU16ATMRH_TU16ATMR13_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR13_MASK                equ 0020h
TU16ATMRH_TU16ATMR14_POSN                equ 0006h
TU16ATMRH_TU16ATMR14_POSITION            equ 0006h
TU16ATMRH_TU16ATMR14_SIZE                equ 0001h
TU16ATMRH_TU16ATMR14_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR14_MASK                equ 0040h
TU16ATMRH_TU16ATMR15_POSN                equ 0007h
TU16ATMRH_TU16ATMR15_POSITION            equ 0007h
TU16ATMRH_TU16ATMR15_SIZE                equ 0001h
TU16ATMRH_TU16ATMR15_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR15_MASK                equ 0080h

// Register: TU16ACRH
#define TU16ACRH TU16ACRH
TU16ACRH                                 equ 03A5h
// bitfield definitions
TU16ACRH_CRH_POSN                        equ 0000h
TU16ACRH_CRH_POSITION                    equ 0000h
TU16ACRH_CRH_SIZE                        equ 0008h
TU16ACRH_CRH_LENGTH                      equ 0008h
TU16ACRH_CRH_MASK                        equ 00FFh
TU16ACRH_CRH0_POSN                       equ 0000h
TU16ACRH_CRH0_POSITION                   equ 0000h
TU16ACRH_CRH0_SIZE                       equ 0001h
TU16ACRH_CRH0_LENGTH                     equ 0001h
TU16ACRH_CRH0_MASK                       equ 0001h
TU16ACRH_CRH1_POSN                       equ 0001h
TU16ACRH_CRH1_POSITION                   equ 0001h
TU16ACRH_CRH1_SIZE                       equ 0001h
TU16ACRH_CRH1_LENGTH                     equ 0001h
TU16ACRH_CRH1_MASK                       equ 0002h
TU16ACRH_CRH2_POSN                       equ 0002h
TU16ACRH_CRH2_POSITION                   equ 0002h
TU16ACRH_CRH2_SIZE                       equ 0001h
TU16ACRH_CRH2_LENGTH                     equ 0001h
TU16ACRH_CRH2_MASK                       equ 0004h
TU16ACRH_CRH3_POSN                       equ 0003h
TU16ACRH_CRH3_POSITION                   equ 0003h
TU16ACRH_CRH3_SIZE                       equ 0001h
TU16ACRH_CRH3_LENGTH                     equ 0001h
TU16ACRH_CRH3_MASK                       equ 0008h
TU16ACRH_CRH4_POSN                       equ 0004h
TU16ACRH_CRH4_POSITION                   equ 0004h
TU16ACRH_CRH4_SIZE                       equ 0001h
TU16ACRH_CRH4_LENGTH                     equ 0001h
TU16ACRH_CRH4_MASK                       equ 0010h
TU16ACRH_CRH5_POSN                       equ 0005h
TU16ACRH_CRH5_POSITION                   equ 0005h
TU16ACRH_CRH5_SIZE                       equ 0001h
TU16ACRH_CRH5_LENGTH                     equ 0001h
TU16ACRH_CRH5_MASK                       equ 0020h
TU16ACRH_CRH6_POSN                       equ 0006h
TU16ACRH_CRH6_POSITION                   equ 0006h
TU16ACRH_CRH6_SIZE                       equ 0001h
TU16ACRH_CRH6_LENGTH                     equ 0001h
TU16ACRH_CRH6_MASK                       equ 0040h
TU16ACRH_CRH7_POSN                       equ 0007h
TU16ACRH_CRH7_POSITION                   equ 0007h
TU16ACRH_CRH7_SIZE                       equ 0001h
TU16ACRH_CRH7_LENGTH                     equ 0001h
TU16ACRH_CRH7_MASK                       equ 0080h
TU16ACRH_TU16ACRH0_POSN                  equ 0000h
TU16ACRH_TU16ACRH0_POSITION              equ 0000h
TU16ACRH_TU16ACRH0_SIZE                  equ 0001h
TU16ACRH_TU16ACRH0_LENGTH                equ 0001h
TU16ACRH_TU16ACRH0_MASK                  equ 0001h
TU16ACRH_TU16ACRH1_POSN                  equ 0001h
TU16ACRH_TU16ACRH1_POSITION              equ 0001h
TU16ACRH_TU16ACRH1_SIZE                  equ 0001h
TU16ACRH_TU16ACRH1_LENGTH                equ 0001h
TU16ACRH_TU16ACRH1_MASK                  equ 0002h
TU16ACRH_TU16ACRH2_POSN                  equ 0002h
TU16ACRH_TU16ACRH2_POSITION              equ 0002h
TU16ACRH_TU16ACRH2_SIZE                  equ 0001h
TU16ACRH_TU16ACRH2_LENGTH                equ 0001h
TU16ACRH_TU16ACRH2_MASK                  equ 0004h
TU16ACRH_TU16ACRH3_POSN                  equ 0003h
TU16ACRH_TU16ACRH3_POSITION              equ 0003h
TU16ACRH_TU16ACRH3_SIZE                  equ 0001h
TU16ACRH_TU16ACRH3_LENGTH                equ 0001h
TU16ACRH_TU16ACRH3_MASK                  equ 0008h
TU16ACRH_TU16ACRH4_POSN                  equ 0004h
TU16ACRH_TU16ACRH4_POSITION              equ 0004h
TU16ACRH_TU16ACRH4_SIZE                  equ 0001h
TU16ACRH_TU16ACRH4_LENGTH                equ 0001h
TU16ACRH_TU16ACRH4_MASK                  equ 0010h
TU16ACRH_TU16ACRH5_POSN                  equ 0005h
TU16ACRH_TU16ACRH5_POSITION              equ 0005h
TU16ACRH_TU16ACRH5_SIZE                  equ 0001h
TU16ACRH_TU16ACRH5_LENGTH                equ 0001h
TU16ACRH_TU16ACRH5_MASK                  equ 0020h
TU16ACRH_TU16ACRH6_POSN                  equ 0006h
TU16ACRH_TU16ACRH6_POSITION              equ 0006h
TU16ACRH_TU16ACRH6_SIZE                  equ 0001h
TU16ACRH_TU16ACRH6_LENGTH                equ 0001h
TU16ACRH_TU16ACRH6_MASK                  equ 0040h
TU16ACRH_TU16ACRH7_POSN                  equ 0007h
TU16ACRH_TU16ACRH7_POSITION              equ 0007h
TU16ACRH_TU16ACRH7_SIZE                  equ 0001h
TU16ACRH_TU16ACRH7_LENGTH                equ 0001h
TU16ACRH_TU16ACRH7_MASK                  equ 0080h
TU16ACRH_TU16ACR8_POSN                   equ 0000h
TU16ACRH_TU16ACR8_POSITION               equ 0000h
TU16ACRH_TU16ACR8_SIZE                   equ 0001h
TU16ACRH_TU16ACR8_LENGTH                 equ 0001h
TU16ACRH_TU16ACR8_MASK                   equ 0001h
TU16ACRH_TU16ACR9_POSN                   equ 0001h
TU16ACRH_TU16ACR9_POSITION               equ 0001h
TU16ACRH_TU16ACR9_SIZE                   equ 0001h
TU16ACRH_TU16ACR9_LENGTH                 equ 0001h
TU16ACRH_TU16ACR9_MASK                   equ 0002h
TU16ACRH_TU16ACR10_POSN                  equ 0002h
TU16ACRH_TU16ACR10_POSITION              equ 0002h
TU16ACRH_TU16ACR10_SIZE                  equ 0001h
TU16ACRH_TU16ACR10_LENGTH                equ 0001h
TU16ACRH_TU16ACR10_MASK                  equ 0004h
TU16ACRH_TU16ACR11_POSN                  equ 0003h
TU16ACRH_TU16ACR11_POSITION              equ 0003h
TU16ACRH_TU16ACR11_SIZE                  equ 0001h
TU16ACRH_TU16ACR11_LENGTH                equ 0001h
TU16ACRH_TU16ACR11_MASK                  equ 0008h
TU16ACRH_TU16ACR12_POSN                  equ 0004h
TU16ACRH_TU16ACR12_POSITION              equ 0004h
TU16ACRH_TU16ACR12_SIZE                  equ 0001h
TU16ACRH_TU16ACR12_LENGTH                equ 0001h
TU16ACRH_TU16ACR12_MASK                  equ 0010h
TU16ACRH_TU16ACR13_POSN                  equ 0005h
TU16ACRH_TU16ACR13_POSITION              equ 0005h
TU16ACRH_TU16ACR13_SIZE                  equ 0001h
TU16ACRH_TU16ACR13_LENGTH                equ 0001h
TU16ACRH_TU16ACR13_MASK                  equ 0020h
TU16ACRH_TU16ACR14_POSN                  equ 0006h
TU16ACRH_TU16ACR14_POSITION              equ 0006h
TU16ACRH_TU16ACR14_SIZE                  equ 0001h
TU16ACRH_TU16ACR14_LENGTH                equ 0001h
TU16ACRH_TU16ACR14_MASK                  equ 0040h
TU16ACRH_TU16ACR15_POSN                  equ 0007h
TU16ACRH_TU16ACR15_POSITION              equ 0007h
TU16ACRH_TU16ACR15_SIZE                  equ 0001h
TU16ACRH_TU16ACR15_LENGTH                equ 0001h
TU16ACRH_TU16ACR15_MASK                  equ 0080h

// Register: TU16APR
#define TU16APR TU16APR
TU16APR                                  equ 03A6h

// Register: TU16APRL
#define TU16APRL TU16APRL
TU16APRL                                 equ 03A6h
// bitfield definitions
TU16APRL_PRL_POSN                        equ 0000h
TU16APRL_PRL_POSITION                    equ 0000h
TU16APRL_PRL_SIZE                        equ 0008h
TU16APRL_PRL_LENGTH                      equ 0008h
TU16APRL_PRL_MASK                        equ 00FFh
TU16APRL_PRL0_POSN                       equ 0000h
TU16APRL_PRL0_POSITION                   equ 0000h
TU16APRL_PRL0_SIZE                       equ 0001h
TU16APRL_PRL0_LENGTH                     equ 0001h
TU16APRL_PRL0_MASK                       equ 0001h
TU16APRL_PRL1_POSN                       equ 0001h
TU16APRL_PRL1_POSITION                   equ 0001h
TU16APRL_PRL1_SIZE                       equ 0001h
TU16APRL_PRL1_LENGTH                     equ 0001h
TU16APRL_PRL1_MASK                       equ 0002h
TU16APRL_PRL2_POSN                       equ 0002h
TU16APRL_PRL2_POSITION                   equ 0002h
TU16APRL_PRL2_SIZE                       equ 0001h
TU16APRL_PRL2_LENGTH                     equ 0001h
TU16APRL_PRL2_MASK                       equ 0004h
TU16APRL_PRL3_POSN                       equ 0003h
TU16APRL_PRL3_POSITION                   equ 0003h
TU16APRL_PRL3_SIZE                       equ 0001h
TU16APRL_PRL3_LENGTH                     equ 0001h
TU16APRL_PRL3_MASK                       equ 0008h
TU16APRL_PRL4_POSN                       equ 0004h
TU16APRL_PRL4_POSITION                   equ 0004h
TU16APRL_PRL4_SIZE                       equ 0001h
TU16APRL_PRL4_LENGTH                     equ 0001h
TU16APRL_PRL4_MASK                       equ 0010h
TU16APRL_PRL5_POSN                       equ 0005h
TU16APRL_PRL5_POSITION                   equ 0005h
TU16APRL_PRL5_SIZE                       equ 0001h
TU16APRL_PRL5_LENGTH                     equ 0001h
TU16APRL_PRL5_MASK                       equ 0020h
TU16APRL_PRL6_POSN                       equ 0006h
TU16APRL_PRL6_POSITION                   equ 0006h
TU16APRL_PRL6_SIZE                       equ 0001h
TU16APRL_PRL6_LENGTH                     equ 0001h
TU16APRL_PRL6_MASK                       equ 0040h
TU16APRL_PRL7_POSN                       equ 0007h
TU16APRL_PRL7_POSITION                   equ 0007h
TU16APRL_PRL7_SIZE                       equ 0001h
TU16APRL_PRL7_LENGTH                     equ 0001h
TU16APRL_PRL7_MASK                       equ 0080h
TU16APRL_TU16APRL0_POSN                  equ 0000h
TU16APRL_TU16APRL0_POSITION              equ 0000h
TU16APRL_TU16APRL0_SIZE                  equ 0001h
TU16APRL_TU16APRL0_LENGTH                equ 0001h
TU16APRL_TU16APRL0_MASK                  equ 0001h
TU16APRL_TU16APRL1_POSN                  equ 0001h
TU16APRL_TU16APRL1_POSITION              equ 0001h
TU16APRL_TU16APRL1_SIZE                  equ 0001h
TU16APRL_TU16APRL1_LENGTH                equ 0001h
TU16APRL_TU16APRL1_MASK                  equ 0002h
TU16APRL_TU16APRL2_POSN                  equ 0002h
TU16APRL_TU16APRL2_POSITION              equ 0002h
TU16APRL_TU16APRL2_SIZE                  equ 0001h
TU16APRL_TU16APRL2_LENGTH                equ 0001h
TU16APRL_TU16APRL2_MASK                  equ 0004h
TU16APRL_TU16APRL3_POSN                  equ 0003h
TU16APRL_TU16APRL3_POSITION              equ 0003h
TU16APRL_TU16APRL3_SIZE                  equ 0001h
TU16APRL_TU16APRL3_LENGTH                equ 0001h
TU16APRL_TU16APRL3_MASK                  equ 0008h
TU16APRL_TU16APRL4_POSN                  equ 0004h
TU16APRL_TU16APRL4_POSITION              equ 0004h
TU16APRL_TU16APRL4_SIZE                  equ 0001h
TU16APRL_TU16APRL4_LENGTH                equ 0001h
TU16APRL_TU16APRL4_MASK                  equ 0010h
TU16APRL_TU16APRL5_POSN                  equ 0005h
TU16APRL_TU16APRL5_POSITION              equ 0005h
TU16APRL_TU16APRL5_SIZE                  equ 0001h
TU16APRL_TU16APRL5_LENGTH                equ 0001h
TU16APRL_TU16APRL5_MASK                  equ 0020h
TU16APRL_TU16APRL6_POSN                  equ 0006h
TU16APRL_TU16APRL6_POSITION              equ 0006h
TU16APRL_TU16APRL6_SIZE                  equ 0001h
TU16APRL_TU16APRL6_LENGTH                equ 0001h
TU16APRL_TU16APRL6_MASK                  equ 0040h
TU16APRL_TU16APRL7_POSN                  equ 0007h
TU16APRL_TU16APRL7_POSITION              equ 0007h
TU16APRL_TU16APRL7_SIZE                  equ 0001h
TU16APRL_TU16APRL7_LENGTH                equ 0001h
TU16APRL_TU16APRL7_MASK                  equ 0080h
TU16APRL_TU16APR0_POSN                   equ 0000h
TU16APRL_TU16APR0_POSITION               equ 0000h
TU16APRL_TU16APR0_SIZE                   equ 0001h
TU16APRL_TU16APR0_LENGTH                 equ 0001h
TU16APRL_TU16APR0_MASK                   equ 0001h
TU16APRL_TU16APR1_POSN                   equ 0001h
TU16APRL_TU16APR1_POSITION               equ 0001h
TU16APRL_TU16APR1_SIZE                   equ 0001h
TU16APRL_TU16APR1_LENGTH                 equ 0001h
TU16APRL_TU16APR1_MASK                   equ 0002h
TU16APRL_TU16APR2_POSN                   equ 0002h
TU16APRL_TU16APR2_POSITION               equ 0002h
TU16APRL_TU16APR2_SIZE                   equ 0001h
TU16APRL_TU16APR2_LENGTH                 equ 0001h
TU16APRL_TU16APR2_MASK                   equ 0004h
TU16APRL_TU16APR3_POSN                   equ 0003h
TU16APRL_TU16APR3_POSITION               equ 0003h
TU16APRL_TU16APR3_SIZE                   equ 0001h
TU16APRL_TU16APR3_LENGTH                 equ 0001h
TU16APRL_TU16APR3_MASK                   equ 0008h
TU16APRL_TU16APR4_POSN                   equ 0004h
TU16APRL_TU16APR4_POSITION               equ 0004h
TU16APRL_TU16APR4_SIZE                   equ 0001h
TU16APRL_TU16APR4_LENGTH                 equ 0001h
TU16APRL_TU16APR4_MASK                   equ 0010h
TU16APRL_TU16APR5_POSN                   equ 0005h
TU16APRL_TU16APR5_POSITION               equ 0005h
TU16APRL_TU16APR5_SIZE                   equ 0001h
TU16APRL_TU16APR5_LENGTH                 equ 0001h
TU16APRL_TU16APR5_MASK                   equ 0020h
TU16APRL_TU16APR6_POSN                   equ 0006h
TU16APRL_TU16APR6_POSITION               equ 0006h
TU16APRL_TU16APR6_SIZE                   equ 0001h
TU16APRL_TU16APR6_LENGTH                 equ 0001h
TU16APRL_TU16APR6_MASK                   equ 0040h
TU16APRL_TU16APR7_POSN                   equ 0007h
TU16APRL_TU16APR7_POSITION               equ 0007h
TU16APRL_TU16APR7_SIZE                   equ 0001h
TU16APRL_TU16APR7_LENGTH                 equ 0001h
TU16APRL_TU16APR7_MASK                   equ 0080h

