garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f44q71.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 0420h
// bitfield definitions
ANSELE_ANSELE0_POSN                      equ 0000h
ANSELE_ANSELE0_POSITION                  equ 0000h
ANSELE_ANSELE0_SIZE                      equ 0001h
ANSELE_ANSELE0_LENGTH                    equ 0001h
ANSELE_ANSELE0_MASK                      equ 0001h
ANSELE_ANSELE1_POSN                      equ 0001h
ANSELE_ANSELE1_POSITION                  equ 0001h
ANSELE_ANSELE1_SIZE                      equ 0001h
ANSELE_ANSELE1_LENGTH                    equ 0001h
ANSELE_ANSELE1_MASK                      equ 0002h
ANSELE_ANSELE2_POSN                      equ 0002h
ANSELE_ANSELE2_POSITION                  equ 0002h
ANSELE_ANSELE2_SIZE                      equ 0001h
ANSELE_ANSELE2_LENGTH                    equ 0001h
ANSELE_ANSELE2_MASK                      equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0421h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 0422h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0423h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0424h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 0425h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 0426h
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0427h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: IOCWP
#define IOCWP IOCWP
IOCWP                                    equ 043Dh
// bitfield definitions
IOCWP_IOCWP0_POSN                        equ 0000h
IOCWP_IOCWP0_POSITION                    equ 0000h
IOCWP_IOCWP0_SIZE                        equ 0001h
IOCWP_IOCWP0_LENGTH                      equ 0001h
IOCWP_IOCWP0_MASK                        equ 0001h
IOCWP_IOCWP1_POSN                        equ 0001h
IOCWP_IOCWP1_POSITION                    equ 0001h
IOCWP_IOCWP1_SIZE                        equ 0001h
IOCWP_IOCWP1_LENGTH                      equ 0001h
IOCWP_IOCWP1_MASK                        equ 0002h
IOCWP_IOCWP2_POSN                        equ 0002h
IOCWP_IOCWP2_POSITION                    equ 0002h
IOCWP_IOCWP2_SIZE                        equ 0001h
IOCWP_IOCWP2_LENGTH                      equ 0001h
IOCWP_IOCWP2_MASK                        equ 0004h
IOCWP_IOCWP3_POSN                        equ 0003h
IOCWP_IOCWP3_POSITION                    equ 0003h
IOCWP_IOCWP3_SIZE                        equ 0001h
IOCWP_IOCWP3_LENGTH                      equ 0001h
IOCWP_IOCWP3_MASK                        equ 0008h
IOCWP_IOCWP4_POSN                        equ 0004h
IOCWP_IOCWP4_POSITION                    equ 0004h
IOCWP_IOCWP4_SIZE                        equ 0001h
IOCWP_IOCWP4_LENGTH                      equ 0001h
IOCWP_IOCWP4_MASK                        equ 0010h
IOCWP_IOCWP5_POSN                        equ 0005h
IOCWP_IOCWP5_POSITION                    equ 0005h
IOCWP_IOCWP5_SIZE                        equ 0001h
IOCWP_IOCWP5_LENGTH                      equ 0001h
IOCWP_IOCWP5_MASK                        equ 0020h
IOCWP_IOCWP6_POSN                        equ 0006h
IOCWP_IOCWP6_POSITION                    equ 0006h
IOCWP_IOCWP6_SIZE                        equ 0001h
IOCWP_IOCWP6_LENGTH                      equ 0001h
IOCWP_IOCWP6_MASK                        equ 0040h
IOCWP_IOCWP7_POSN                        equ 0007h
IOCWP_IOCWP7_POSITION                    equ 0007h
IOCWP_IOCWP7_SIZE                        equ 0001h
IOCWP_IOCWP7_LENGTH                      equ 0001h
IOCWP_IOCWP7_MASK                        equ 0080h

// Register: IOCWN
#define IOCWN IOCWN
IOCWN                                    equ 043Eh
// bitfield definitions
IOCWN_IOCWN0_POSN                        equ 0000h
IOCWN_IOCWN0_POSITION                    equ 0000h
IOCWN_IOCWN0_SIZE                        equ 0001h
IOCWN_IOCWN0_LENGTH                      equ 0001h
IOCWN_IOCWN0_MASK                        equ 0001h
IOCWN_IOCWN1_POSN                        equ 0001h
IOCWN_IOCWN1_POSITION                    equ 0001h
IOCWN_IOCWN1_SIZE                        equ 0001h
IOCWN_IOCWN1_LENGTH                      equ 0001h
IOCWN_IOCWN1_MASK                        equ 0002h
IOCWN_IOCWN2_POSN                        equ 0002h
IOCWN_IOCWN2_POSITION                    equ 0002h
IOCWN_IOCWN2_SIZE                        equ 0001h
IOCWN_IOCWN2_LENGTH                      equ 0001h
IOCWN_IOCWN2_MASK                        equ 0004h
IOCWN_IOCWN3_POSN                        equ 0003h
IOCWN_IOCWN3_POSITION                    equ 0003h
IOCWN_IOCWN3_SIZE                        equ 0001h
IOCWN_IOCWN3_LENGTH                      equ 0001h
IOCWN_IOCWN3_MASK                        equ 0008h
IOCWN_IOCWN4_POSN                        equ 0004h
IOCWN_IOCWN4_POSITION                    equ 0004h
IOCWN_IOCWN4_SIZE                        equ 0001h
IOCWN_IOCWN4_LENGTH                      equ 0001h
IOCWN_IOCWN4_MASK                        equ 0010h
IOCWN_IOCWN5_POSN                        equ 0005h
IOCWN_IOCWN5_POSITION                    equ 0005h
IOCWN_IOCWN5_SIZE                        equ 0001h
IOCWN_IOCWN5_LENGTH                      equ 0001h
IOCWN_IOCWN5_MASK                        equ 0020h
IOCWN_IOCWN6_POSN                        equ 0006h
IOCWN_IOCWN6_POSITION                    equ 0006h
IOCWN_IOCWN6_SIZE                        equ 0001h
IOCWN_IOCWN6_LENGTH                      equ 0001h
IOCWN_IOCWN6_MASK                        equ 0040h
IOCWN_IOCWN7_POSN                        equ 0007h
IOCWN_IOCWN7_POSITION                    equ 0007h
IOCWN_IOCWN7_SIZE                        equ 0001h
IOCWN_IOCWN7_LENGTH                      equ 0001h
IOCWN_IOCWN7_MASK                        equ 0080h

// Register: IOCWF
#define IOCWF IOCWF
IOCWF                                    equ 043Fh
// bitfield definitions
IOCWF_IOCWF0_POSN                        equ 0000h
IOCWF_IOCWF0_POSITION                    equ 0000h
IOCWF_IOCWF0_SIZE                        equ 0001h
IOCWF_IOCWF0_LENGTH                      equ 0001h
IOCWF_IOCWF0_MASK                        equ 0001h
IOCWF_IOCWF1_POSN                        equ 0001h
IOCWF_IOCWF1_POSITION                    equ 0001h
IOCWF_IOCWF1_SIZE                        equ 0001h
IOCWF_IOCWF1_LENGTH                      equ 0001h
IOCWF_IOCWF1_MASK                        equ 0002h
IOCWF_IOCWF2_POSN                        equ 0002h
IOCWF_IOCWF2_POSITION                    equ 0002h
IOCWF_IOCWF2_SIZE                        equ 0001h
IOCWF_IOCWF2_LENGTH                      equ 0001h
IOCWF_IOCWF2_MASK                        equ 0004h
IOCWF_IOCWF3_POSN                        equ 0003h
IOCWF_IOCWF3_POSITION                    equ 0003h
IOCWF_IOCWF3_SIZE                        equ 0001h
IOCWF_IOCWF3_LENGTH                      equ 0001h
IOCWF_IOCWF3_MASK                        equ 0008h
IOCWF_IOCWF4_POSN                        equ 0004h
IOCWF_IOCWF4_POSITION                    equ 0004h
IOCWF_IOCWF4_SIZE                        equ 0001h
IOCWF_IOCWF4_LENGTH                      equ 0001h
IOCWF_IOCWF4_MASK                        equ 0010h
IOCWF_IOCWF5_POSN                        equ 0005h
IOCWF_IOCWF5_POSITION                    equ 0005h
IOCWF_IOCWF5_SIZE                        equ 0001h
IOCWF_IOCWF5_LENGTH                      equ 0001h
IOCWF_IOCWF5_MASK                        equ 0020h
IOCWF_IOCWF6_POSN                        equ 0006h
IOCWF_IOCWF6_POSITION                    equ 0006h
IOCWF_IOCWF6_SIZE                        equ 0001h
IOCWF_IOCWF6_LENGTH                      equ 0001h
IOCWF_IOCWF6_MASK                        equ 0040h
IOCWF_IOCWF7_POSN                        equ 0007h
IOCWF_IOCWF7_POSITION                    equ 0007h
IOCWF_IOCWF7_SIZE                        equ 0001h
IOCWF_IOCWF7_LENGTH                      equ 0001h
IOCWF_IOCWF7_MASK                        equ 0080h

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
NCO1ACC                                  equ 0440h

